app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 12], ["message", "This comment is created from postman to check POST request"], ["created_at", "2022-07-10 09:16:59.187482"], ["updated_at", "2022-07-10 09:16:59.187482"]]
---
    def create
        @comment = Comment.create(
            post_id: params[:id],
            message: params[:message],
        )

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "message" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["message", nil], ["updated_at", "2022-07-10 09:19:36.150148"], ["id", 11]]
---
    def update
        @comment = Comment.find(params[:id])
        @comment.update(
            message: params[:message]
        )

SELECT "comments".* FROM "comments"
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 12]]
---
    def destroy
        @comments = Comment.all
        @comment = Comment.find(params[:id])
        @comment.destroy