app/controllers/posts_controller.rb

    def create
        @post = Post.create(
            title: params[:title],
            body: params[:body]
        )
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", nil], ["body", nil], ["created_at", "2022-07-09 12:53:34.035167"], ["updated_at", "2022-07-09 12:53:34.035167"]]

    def update
        @post = Post.find(params[:id])
        @post.update(
            title: params[:title],
            body: params[:body],
        )
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["body", nil], ["updated_at", "2022-07-09 13:30:49.710019"], ["id", 5]]

    def destroy
        @posts = Post.all
        @post = Post.find(params[:id])
        @post.destroy
---
SELECT "posts".* FROM "posts"
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]